using System;
using System.Collections.Generic;
using System.Configuration;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Shapes;

namespace БАРСШаблон
{
	/// <summary>
	/// Логика взаимодействия для SettingsWindow.xaml
	/// </summary>
	public partial class SettingsWindow : Window
	{
		public SettingsWindow()
		{
			InitializeComponent();

			МетаВерсияTextBox.Text = МенеджерНастроек.Настройки.Мета.ВерсияМетаописания.Value;
			МетаИдентификаторTextBox.Text = МенеджерНастроек.Настройки.Мета.Идентификатор.Value;
			МетаГруппаTextBox.Text = МенеджерНастроек.Настройки.Мета.Группа.Value;
			МетаДатаНачалаTextBox.Text = МенеджерНастроек.Настройки.Мета.ДатаНачалаДействия.Value;
			МетаДатаОкончанияTextBox.Text = МенеджерНастроек.Настройки.Мета.ДатаОкончанияДействия.Value;
			МетаАвторствоTextBox.Text = МенеджерНастроек.Настройки.Мета.Авторство.Value;
			МетаНомерВерсииTextBox.Text = МенеджерНастроек.Настройки.Мета.НомерВерсии.Value;
			МетаРасположениеШапкиTextBox.Text = МенеджерНастроек.Настройки.Мета.РасположениеШапки.Value;
			МетаВерсияФорматаTextBox.Text = МенеджерНастроек.Настройки.Мета.ВерсияФорматаМетаструктуры.Value;
			МетаМеткаНаименованиеTextBox.Text = МенеджерНастроек.Настройки.Мета.МеткаНаименование.Value;

			ПрефиксыТаблицаTextBox.Text = МенеджерНастроек.Настройки.Теги.ПрефиксТаблицы.Value;
			ПрефиксыСвободнаяЯчейкаTextBox.Text = МенеджерНастроек.Настройки.Теги.ПрефиксСвободнойЯчейки.Value;
			ПрефиксыСтолбецTextBox.Text = МенеджерНастроек.Настройки.Теги.ПрефиксСтолбца.Value;
			ПрефиксыСтрокаTextBox.Text = МенеджерНастроек.Настройки.Теги.ПрефиксСтроки.Value;
			КоличествоСловТегаTextBox.Text = МенеджерНастроек.Настройки.Теги.КоличествоСловВТеге.Value;
			КоличествоСимволовТегаTextBox.Text = МенеджерНастроек.Настройки.Теги.КоличествоСимволовВТеге.Value;

			МеткаДинамическаяTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаТипТаблицыДинамическая.Value;
			МеткаСтатическаяTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаТипТаблицыСтатическая.Value;
			МеткаКодыСтрокИСтолбцовTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаКодыСтрокИСтолбцов.Value;
			МеткаКодыСтолбцовTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаКодыСтолбцов.Value;
			МеткаКодыСтрокTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаКодыСтрок.Value;
			МеткаНаименованиеТаблицыTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаНаименование.Value;
			МеткаТегТаблицыTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаТег.Value;
			МеткаКодТаблицыTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаКод.Value;

		}

		private void Window_Closing(object sender, System.ComponentModel.CancelEventArgs e)
		{
			MainWindow mainWindow = new MainWindow();
			mainWindow.Show();
		}

		private void CancelButton_Click(object sender, RoutedEventArgs e)
		{
			Close();
		}

		private void SaveButton_Click(object sender, RoutedEventArgs e)
		{
			МенеджерНастроек.Настройки.Мета.ВерсияМетаописания.Value = МетаВерсияTextBox.Text;
			МенеджерНастроек.Настройки.Мета.Идентификатор.Value = МетаИдентификаторTextBox.Text;
			МенеджерНастроек.Настройки.Мета.Группа.Value = МетаГруппаTextBox.Text;
			МенеджерНастроек.Настройки.Мета.ДатаНачалаДействия.Value = МетаДатаНачалаTextBox.Text;
			МенеджерНастроек.Настройки.Мета.ДатаОкончанияДействия.Value = МетаДатаОкончанияTextBox.Text;
			МенеджерНастроек.Настройки.Мета.Авторство.Value = МетаАвторствоTextBox.Text;
			МенеджерНастроек.Настройки.Мета.НомерВерсии.Value = МетаНомерВерсииTextBox.Text;
			МенеджерНастроек.Настройки.Мета.РасположениеШапки.Value = МетаРасположениеШапкиTextBox.Text;
			МенеджерНастроек.Настройки.Мета.ВерсияФорматаМетаструктуры.Value = МетаВерсияФорматаTextBox.Text;
			МенеджерНастроек.Настройки.Мета.МеткаНаименование.Value = МетаМеткаНаименованиеTextBox.Text;

			МенеджерНастроек.Настройки.Теги.ПрефиксТаблицы.Value = ПрефиксыТаблицаTextBox.Text;
			МенеджерНастроек.Настройки.Теги.ПрефиксСвободнойЯчейки.Value = ПрефиксыСвободнаяЯчейкаTextBox.Text;
			МенеджерНастроек.Настройки.Теги.ПрефиксСтолбца.Value = ПрефиксыСтолбецTextBox.Text;
			МенеджерНастроек.Настройки.Теги.ПрефиксСтроки.Value = ПрефиксыСтрокаTextBox.Text;
			МенеджерНастроек.Настройки.Теги.КоличествоСловВТеге.Value = КоличествоСловТегаTextBox.Text;
			МенеджерНастроек.Настройки.Теги.КоличествоСимволовВТеге.Value = КоличествоСимволовТегаTextBox.Text;

			МенеджерНастроек.Настройки.Разметка.МеткаТипТаблицыДинамическая.Value = МеткаДинамическаяTextBox.Text;
			МенеджерНастроек.Настройки.Разметка.МеткаТипТаблицыСтатическая.Value = МеткаСтатическаяTextBox.Text;
			МенеджерНастроек.Настройки.Разметка.МеткаКодыСтрокИСтолбцов.Value = МеткаКодыСтрокИСтолбцовTextBox.Text;
			МенеджерНастроек.Настройки.Разметка.МеткаКодыСтолбцов.Value = МеткаКодыСтолбцовTextBox.Text;
			МенеджерНастроек.Настройки.Разметка.МеткаКодыСтрок.Value = МеткаКодыСтрокTextBox.Text;
			МенеджерНастроек.Настройки.Разметка.МеткаНаименование.Value = МеткаНаименованиеТаблицыTextBox.Text;
			МенеджерНастроек.Настройки.Разметка.МеткаТег.Value = МеткаТегТаблицыTextBox.Text;
			МенеджерНастроек.Настройки.Разметка.МеткаКод.Value = МеткаКодТаблицыTextBox.Text;

			МенеджерНастроек.СохранитьНастройки();

			Close();
		}

		private void ResetSettingsButton_Click(object sender, RoutedEventArgs e)
		{
			МетаВерсияTextBox.Text = МенеджерНастроек.Настройки.Мета.ВерсияМетаописания.Default;
			МетаИдентификаторTextBox.Text = МенеджерНастроек.Настройки.Мета.Идентификатор.Default;
			МетаГруппаTextBox.Text = МенеджерНастроек.Настройки.Мета.Группа.Default;
			МетаДатаНачалаTextBox.Text = МенеджерНастроек.Настройки.Мета.ДатаНачалаДействия.Default;
			МетаДатаОкончанияTextBox.Text = МенеджерНастроек.Настройки.Мета.ДатаОкончанияДействия.Default;
			МетаАвторствоTextBox.Text = МенеджерНастроек.Настройки.Мета.Авторство.Default;
			МетаНомерВерсииTextBox.Text = МенеджерНастроек.Настройки.Мета.НомерВерсии.Default;
			МетаРасположениеШапкиTextBox.Text = МенеджерНастроек.Настройки.Мета.РасположениеШапки.Default;
			МетаВерсияФорматаTextBox.Text = МенеджерНастроек.Настройки.Мета.ВерсияФорматаМетаструктуры.Default;
			МетаМеткаНаименованиеTextBox.Text = МенеджерНастроек.Настройки.Мета.МеткаНаименование.Default;

			ПрефиксыТаблицаTextBox.Text = МенеджерНастроек.Настройки.Теги.ПрефиксТаблицы.Default;
			ПрефиксыСвободнаяЯчейкаTextBox.Text = МенеджерНастроек.Настройки.Теги.ПрефиксСвободнойЯчейки.Default;
			ПрефиксыСтолбецTextBox.Text = МенеджерНастроек.Настройки.Теги.ПрефиксСтолбца.Default;
			ПрефиксыСтрокаTextBox.Text = МенеджерНастроек.Настройки.Теги.ПрефиксСтроки.Default;
			КоличествоСловТегаTextBox.Text = МенеджерНастроек.Настройки.Теги.КоличествоСловВТеге.Default;
			КоличествоСимволовТегаTextBox.Text = МенеджерНастроек.Настройки.Теги.КоличествоСимволовВТеге.Default;

			МеткаДинамическаяTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаТипТаблицыДинамическая.Default;
			МеткаСтатическаяTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаТипТаблицыСтатическая.Default;
			МеткаКодыСтрокИСтолбцовTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаКодыСтрокИСтолбцов.Default;
			МеткаКодыСтолбцовTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаКодыСтолбцов.Default;
			МеткаКодыСтрокTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаКодыСтрок.Default;
			МеткаНаименованиеТаблицыTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаНаименование.Default;
			МеткаТегТаблицыTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаТег.Default;
			МеткаКодТаблицыTextBox.Text = МенеджерНастроек.Настройки.Разметка.МеткаКод.Default;
		}
	}
}
